tutorials/mesh/movingBlockRBF/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libLEMOS-2.3.x.so" );


solver RBFMotionSolver;
RBFMotionSolverCoeffs
{


movingPatches ( block );

staticPatches ( left right top bottom);

coarseningRatio 5;

includeStaticPatches   no;
frozenInterpolation    yes;


interpolation
{
    RBF  IMQB;
    focalPoint (0 0 0);
    innerRadius 2.5;//5.0
    outerRadius 12;
    polynomials true;

    W2Coeffs
    {
        radius     1.0;
    }
    TPSCoeffs
    {
        radius     5.0;
    }
    GaussCoeffs
    {
        radius     1;
    }
    IMQBCoeffs
    {
        radius     0.001;
    }
}

}
// ************************************************************************* //
