tutorials/mesh/movingBlockRBF/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name from directory
application="pimpleDyMFoam"

wmake libso RBFMotionFunction
runApplication blockMesh
runApplication $application
